echo '-------------- Start!! --------------'
echo '-------------- 네트워크 인증서 발급 -------------------'
./generate.sh
echo '-------------- 네트워크 인증서 발급 완료 -------------------'
echo '-------------- 3초 대기 --------------'
sleep 3

echo '-------------- node 실행 --------------'
./up.sh
echo '-------------- node 실행 완료 --------------'
echo '-------------- 10초 대기 --------------'
sleep 10

echo '-------------- 체인코드 설치, 보증 --------------'
./channel.sh
echo '-------------- 3초 대기 --------------'
sleep 3

echo '-------------- Key 초기화 --------------'
cd ../../web-app/server/
rm -rf wallet
./updateKeystore.sh
echo '-------------- Key 초기화 완료 --------------'
echo '-------------- 2초 대기 --------------'
sleep 2

echo '-------------- admin 등록 --------------'
node enrollAdmin.js
echo '-------------- 3초 대기 --------------'
sleep 3

echo '-------------- user 등록 --------------'
node registerUser.js
echo '-------------- End!! --------------'
